/**
*? Напишіть код, який запитуватиме
*? логін за допомогою prompt та логувати результат
*? у консоль браузера
    
*? Якщо відвідувач вводить "Адмін",
*? то prompt запитує пароль.
*? Якщо нічого не ввели або натиснуто клавішу Esc
*? вивести рядок "Скасовано"
*? В іншому випадку вивести рядок "Я вас не знаю"
    
*? Пароль перевіряти так:
*? Якщо введено пароль "Я головний",
*? то вивести рядок "Здрастуйте!"
*? інакше виводити рядок "Невірний пароль!"
  */
 const que = prompt("Your login?");
 console.log(que);
 const valid_password = "Я головний";
 const adm = "Admin";
 if(que === adm) {
   const password = prompt("Enter password please!");
   if(password) {
    if(password === valid_password) {
        alert("Здрастуйте!");
    } else {
        alert("Невірний пароль!");
    }
   } else {
    alert("Скасовано");
   }
 } else {
    alert("I don't know you");
 }